a = [1, 2, 3]
b = a
c = [1, 2, 3] # новий список

'''
"is" - використовується для перевірки ідентичності об'єктів, тобто для встановлення, 
чи дві змінні вказують на один і той самий об'єкт в пам'яті.
Цей оператор, який часто називають оператором ідентичності, 
має особливе значення при роботі з незмінними типами даних, 
такими як числа та рядки. У випадку з незмінними типами даних Python 
може кешувати об'єкти, що іноді призводить до того, 
що оператор is повертає True для об'єктів з однаковими значеннями, 
як у випадку з дуже малими цілими числами або короткими рядками.
'''
print(f'a is b? {a is b}')  # True
print(f'a is c? {a is c}')  # False