import random

cards = ["Туз", "Король", "Дама", "Валет", "10", "9", "8", "7", "6"]

for val in range(5):
    random.shuffle(cards)
    print(f"Перемішана колода: {cards}")
'''
Перемішана колода: ['Король', 'Туз', '10', '6', 'Валет', 'Дама', '7', '9', '8']
Перемішана колода: ['7', '8', 'Дама', '9', 'Туз', '6', '10', 'Валет', 'Король']
Перемішана колода: ['Дама', '6', '7', 'Туз', 'Валет', '8', '9', '10', 'Король']
Перемішана колода: ['10', 'Дама', '6', 'Валет', '7', 'Туз', '9', 'Король', '8']
Перемішана колода: ['8', 'Туз', '9', 'Король', '10', '7', 'Дама', 'Валет', '6']
'''