import re

text = "Python - це проста, але потужна мова програмування."
pattern = r"\s+"
words = re.split(pattern, text)

print(words)  # Виведе список слів у рядку


text_ = "Python - потужна; проста, універсальна: мова!"
pattern_ = r"[;,\-:!\s]+"
elements_ = re.split(pattern_, text_)

print(elements_)  # Виведе список частин, розділених пунктуацією

'''
Тут регулярний вираз [;,\-:!\s]+ збігається з будь-якою послідовністю 
одного або більше символів з набору ;, ,, -, :, ! або будь-якого 
пробільного символу. Завдяки квантифікатору +, послідовність 
роздільників розглядається як один роздільник, що допомагає 
уникнути створення пустих рядків у результаті виведення.
'''

_text = "apple#banana!mango@orange;kiwi"
_pattern = r"[#@;!]"
_fruits = re.split(_pattern, _text)

print(_fruits) # ['apple', 'banana', 'mango', 'orange', 'kiwi']
'''
У цьому прикладі [#@;!] створює набір символів, 
який включає #, @, ;, і !, кожен з яких може 
бути використаний як роздільник. І ми отримуємо 
список з фруктами
'''