'''
Для пошуку деякого символу або підрядка 
у рядку можна скористатися методом find
'''
s = "Hi there!"

start = 0
end = 7

print(s.find("er", start, end)) # 5
print(s.find("q")) # -1

'''
Цей метод повертає індекс початку першого збігу в рядку s, 
починаючи з позиції start до позиції end. Якщо start та end 
не вказані, то пошук відбувається з початку і до кінця рядку. 
Метод повертає -1, якщо послідовність не знайдена.
'''

s = 'Some words'

print(s.find("o"))  # 1
print(s.rfind('o')) # 6

'''
Ще один метод пошуку підрядка у рядку дуже схожий на 
find — це index. Основна відмінність полягає в тому, 
що якщо index не знайде підрядок, то викличе виняток ValueError.

Якщо вам потрібно здійснити пошук підрядка у рядку справа, 
а не зліва як у find, то для цього існує метод rfind

Вираз s.find("o") поверне 1, а вираз s.rfind('o') 
поверне 6 бо шукає справа рядка і матимемо наступне виведення
'''