name = "Alice"
formatted = f"{name:>10}"
print(formatted)  # Виведе: '     Alice' (вирівнювання праворуч)

'''
<: Вирівнювання вмісту по лівому краю.
>: Вирівнювання вмісту по правому краю.
^: Вирівнювання вмісту по центру.
=: Використовується для вирівнювання чисел, при цьому знак (якщо він є) відображається зліва, а число - по правому краю поля.
'''

completion = 0.7567
formatted = f"{completion:.1%}"
print(formatted)  # Виведе: '75.7%

progress = 0.5
formatted_ = f"{progress:.0%}"
print(formatted_) # 50%