intab = "aeiou"
outtab = "12345"
trantab = str.maketrans(intab, outtab)

str = "This is string example work"
print(str.translate(trantab)) # Th3s 3s str3ng 2x1mpl2 w4rk

'''
У цьому прикладі всі голосні літери 'a', 'e', 'i', 'o', 'u' 
у рядку замінюються відповідно на числа '1', '2', '3', '4', '5'. 
Результатом виконання коду буде рядок "Th3s 3s str3ng 2x1mpl2".

Метод translate() також може використовуватися для видалення 
певних символів із рядка. Для цього передайте в maketrans() 
третій аргумент - рядок символів, які потрібно видалити.
'''

intab_ = "aeiou"
trantab_ = str.maketrans('', '', intab_) # 3 аргумент - рядок символів, які потрібно видалити

str_ = "This is string example"
print(str_.translate(trantab_)) #Ths s strng xmpl

'''
Цей приклад видаляє всі голосні літери з рядка, 
виводячи рядок "Ths s strng xmpl" без голосних.
Метод може бути використаний для різноманітних 
завдань з обробки тексту. Нормалізація тексту, 
це коли треба замінити або видалити специфічні 
символи. Операції кодування та декодування - 
створення простих кодувань шляхом заміни символів. 
Фільтрація тексту шляхом видалення небажаних 
символів, наприклад, пунктуації або цифр.
Метод є чудовим вибором для складніших 
завдань з обробки та трансформації рядків.
'''