def caching_fibonacci():
    # Створюємо кеш для зберігання обчислених значень Фібоначчі
    cache = {}

    # Внутрішня функція для обчислення чисел Фібоначчі
    def fibonacci(n):
        # Якщо число менше або дорівнює 1, повертаємо саме число
        if n <= 1:
            return n
        # Якщо число вже є у кеші, повертаємо його значення
        elif n in cache:
            return cache[n]
        # Якщо число не знаходиться у кеші, обчислюємо його та зберігаємо в кеші
        else:
            cache[n] = fibonacci(n - 1) + fibonacci(n - 2)
            return cache[n]

    # Повертаємо внутрішню функцію для зовнішнього використання
    return fibonacci

# Приклад використання
fib = caching_fibonacci()
# Використовуємо функцію fibonacci для обчислення чисел Фібоначчі
print(fib(10))  # Виведе 55
print(fib(15))  # Виведе 610
print(fib(100)) # Виведе 354224848179261915075
