'''
Вимоги до завдання:
min - мінімальне можливе число у наборі (не менше 1).
max - максимальне можливе число у наборі (не більше 1000).
quantity - кількість чисел, які потрібно вибрати (значення між min і max).
Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
Функція повертає список випадково вибраних, відсортованих чисел. 
Числа в наборі не повинні повторюватися. Якщо параметри не 
відповідають заданим обмеженням, функція повертає пустий список.
'''

from random import randint

def get_numbers_ticket(min_, max_, quantity):
    try: # Обробка вийнятків, якщо все ок то відбувається "магія"
        int(min_) # Потрібно щоб відпрацював except
        int(max_)
        int(quantity)
        numbers = set() # Використовую множини

        if((max_ <= 1000 and min_ >=1) and ((max_ - min_) >= quantity)): # тут вся магія
            while len(numbers) != quantity: # перебір випадкових чисел у циклі, допоки не накопичим "quantity" цифер
                numbers.add(randint(min_, max_)) # тут задається мінімум і максимум генерованих чисел
            return sorted(numbers) # сортуємо отримані випадкові числа, від найменьшого до найбільшого
        print("Number error, use min >= 1, max <= 1000, quantity is need to be in range max-min") # Помилка вводу
        return list(numbers) # Конвертую множини у список згідно завдання
    
    except ValueError: # Якщо щось не так то кажемо як треба
        print(f"Number error, use min >= 1, max <= 1000, quantity is need to be in range max-min") # Помилка вводу
        return list(numbers)

lottery_numbers = get_numbers_ticket(2, 8, 4)
print("Ваші лотерейні числа:", lottery_numbers)

'''
Критерії оцінювання:
Валідність вхідних даних: функція повинна перевіряти коректність параметрів.
Унікальність результату: усі числа у видачі повинні бути унікальними.
Відповідність вимогам: результат має бути у вигляді відсортованого списку.
Читабельність коду: код має бути чистим і добре документованим.
Приклад: Припустимо, вам потрібно вибрати 6 унікальних чисел для 
лотерейного квитка, де числа повинні бути у діапазоні від 1 до 49.
'''