from datetime import datetime

# Створення об'єкта datetime
now = datetime.now()

# Отримання ISO календаря
iso_calendar = now.isocalendar()

print(f"ISO рік: {iso_calendar[0]}, ISO тиждень: {iso_calendar[1]}, ISO день тижня: {iso_calendar[2]}") # tuples

'''
Метод isocalendar() корисний у ситуаціях, 
коли потрібно працювати з тижневими інтервалами 
або розраховувати дати у форматі, який широко 
використовується в бізнес-плануванні та логістиці. 
Він також може бути корисним для визначення 
конкретного тижня року для подій або при плануванні завдань.
'''