'''
У цьому прикладі name — це позиційний параметр, 
а message — ключовий параметр зі значенням 
за замовчуванням "Привіт". При виклику функції 
можна не вказувати message, і тоді буде 
використано значення за замовчуванням.
'''
def greet(name, message="Hello"):
    print(f"{message}, {name}!")

# використовує значення за замовчуванням для message
greet("Serhii")  

# передача власного значення для message
greet("Nastia", message="God morning")  

'''--------------------------------------'''

def func(a, b=5, c=10):
    print('a дорівнює', a,', b дорівнює', b,', а c дорівнює', c)

# a дорівнює 3, b дорівнює 7, а c дорівнює 10
func(3, 7)

# a дорівнює 25, b дорівнює 5, а c дорівнює 24
func(25, c=24)

# a дорівнює 100, b дорівнює 5, а c дорівнює 50
func(c=50, a=100)