'''
Під час виклику функції, всі ключові аргументи, 
передані після останнього визначеного аргументу, 
будуть упаковані в словник під ім'ям, 
що йде після ** та зазвичай це kwargs, 
але, як і випадку args, може бути будь-яке інше ім'я.
'''

def greet(**kwargs):
    for key, value in kwargs.items():
        print(f"{key}: {value}")

#greet(name=input("Enter name:"), age=input("Enter age:"))
greet(name="Serhii", age=33)

'''
Якщо виникає питання коли використовувати ці параметри, 
то параметр *args ми використовуємо коли хочемо дозволити 
передавати функції різну кількість позиційних аргументів. 
Параметр **kwargs — коли ми хочемо дозволити передавати 
функції різну кількість ключових аргументів.
'''

def example_function(*args, **kwargs):
    print("Позиційні аргументи:", args)
    print("Ключові аргументи:", kwargs)

example_function(1, 100, 500, name="Serhii", age=33)

'''
Завжди використовуйте *args перед **kwargs у визначенні функції, 
оскільки це обов'язкове правило синтаксису Python.
'''