def say(message, times=1):
    print(message * times)

say('Привіт') 
say('Світ ', 5)

'''
Значеннями за замовчуванням можуть бути 
забезпечені тільки параметри, що знаходяться 
у кінці списку параметрів. Таким чином, 
у списку параметрів функції параметр зі 
значенням за замовчуванням не може 
передувати параметру без значення за замовчуванням. 
Це пов'язано з тим, що значення надаються 
параметрам відповідно до їх положення. 
Наприклад, def func(a, b=5) — допустимо, 
а def func(a=5, b) – не допустимо та призведе до помилки в коді.
'''