from pathlib import Path

p = Path("Python/StepFive/examplePl.txt")
p.write_text("Hello, world!")
print(p.read_text()) 
print("Exists:", p.exists()) 

'''
У даному фрагменті коду використовується модуль pathlib для створення, 
запису, читання та перевірки файлу. Спочатку створюється об'єкт Path, 
який вказує на файл example.txt у директорії де був запущений скрипт. 
За допомогою методу write_text(), у цей файл записується рядок "Hello, world!". 
Потім за допомогою методу read_text() вміст файлу читається і виводиться на екран. 
На завершення, метод exists() використовується для перевірки існування файлу, 
результат чого також виводиться на екран. Весь код демонструє просту інтеракцію 
з файловою системою через об'єктно-орієнтований інтерфейс pathlib.
'''

